### Setting up the Data
We have created a dataset by making a dictionary with features and passing it through the dataframe function.

In [1]:
import pandas as pd

In [2]:
   raw_data = {"first_name": ["Sheldon", "Raj", "Leonard", "Howard", "Amy"],
                "last_name": ["Copper", "Koothrappali", "Hofstadter", "Wolowitz", "Fowler"],
                "age": [42, 38, 36, 41, 35],
                "Comedy_Score": [9, 7, 8, 8, 5],
                "Rating_Score": [25, 25, 49, 62, 70]}

In [16]:
df = pd.DataFrame(raw_data,columns = ["first_name", "last_name", "age",
                                           "Comedy_Score", "Rating_Score"])

In [17]:
df

  first_name     last_name  age  Comedy_Score  Rating_Score
0    Sheldon        Copper   42             9            25
1        Raj  Koothrappali   38             7            25
2    Leonard    Hofstadter   36             8            49
3     Howard      Wolowitz   41             8            62
4        Amy        Fowler   35             5            70

### Maping the values
First we have made a dictionary with the values mapped with another values such that first values is of feature first_name and the next is of new feature subjects.

In [19]:
Subjects = {"Sheldon" : "Science",
                     "Raj" : "Chemistry",
                     "Leonard" : "Maths",
                     "Howard" : "Astronaut",
                     "Amy" : "Science"}
print(Subjects)

{'Sheldon': 'Science', 'Raj': 'Chemistry', 'Leonard': 'Maths', 'Howard': 'Astronaut', 'Amy': 'Science'}

Now we have created a function to map the values of different columns.

In [22]:
df["Subjects"] = df["first_name"].map(Subjects)
df

  first_name     last_name  age  Comedy_Score  Rating_Score   Subjects
0    Sheldon        Copper   42             9            25    Science
1        Raj  Koothrappali   38             7            25  Chemistry
2    Leonard    Hofstadter   36             8            49      Maths
3     Howard      Wolowitz   41             8            62  Astronaut
4        Amy        Fowler   35             5            70    Science